/*********************************/
/*                               */
/*         DATA                  */
/*                               */
/*********************************/
----------------------------------------------------------
INSERT INTO falcuty 
values
('1001',N' Học Máy Tinh'),('1002',N'Kĩ Thuật Máy Tính')

----------------------------------------------------------
INSERT INTO pupil
VALUES 
('210457', N'Nguyễn Hữu Khải','L07','khai.nguyenhuu@hcmut.edu.vn','normal','1001' )

----------------------------------------------------------
INSERT INTO lecturer
VALUES 
('5012345', N'Nguyễn Hữu Luân','luan.nguyenhuu@hcmut.edu.vn','0846141788','1001' )

--------------------------------------------------------
INSERT INTO subject 
values
('CO2004',N'Hệ Cơ sở DL','3'),('SP1008',N'Pháp Luat VN đại cương','4')
----------------------------------------------------------
INSERT INTO room 
VALUES 
('202H3', N'H3');

--------------------------------------------------------
INSERT INTO class
VALUES 
('1001', 'L05' ,'4','6','202H3','5012345','CO2004')
--------------------------------------------------------
INSERT INTO studentList
VALUES 
('210457', '1001' )
--------------------------------------------------------

INSERT INTO lecturerList 
values
('5012345','1001')

----------------------------------------------------------
INSERT INTO registerSubject
values
('210457','CO2004')